experiments/actual-usage-evictor-v2/hnu/results/h0-load/20260614-162913/api-load.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/ubuntu/descheduler-custom/experiments/actual-usage-evictor-v2/k6/api-load.js
        output: json (/home/ubuntu/descheduler-custom/experiments/actual-usage-evictor-v2/hnu/results/h0-load/20260614-162913/api-load.json)

     scenarios: (100.00%) 1 scenario, 160 max VUs, 8m30s max duration (incl. graceful stop):
              * api: 8.00 iterations/s for 8m0s (maxVUs: 60-160, gracefulStop: 30s)


running (0m01.0s), 000/060 VUs, 8 complete and 0 interrupted iterations
api    [   0% ] 000/060 VUs  0m01.0s/8m0s  8.00 iters/s

running (0m02.0s), 000/060 VUs, 16 complete and 0 interrupted iterations
api    [   0% ] 000/060 VUs  0m02.0s/8m0s  8.00 iters/s

running (0m03.0s), 000/060 VUs, 24 complete and 0 interrupted iterations
api    [   1% ] 000/060 VUs  0m03.0s/8m0s  8.00 iters/s

running (0m04.0s), 000/060 VUs, 32 complete and 0 interrupted iterations
api    [   1% ] 000/060 VUs  0m04.0s/8m0s  8.00 iters/s

running (0m05.0s), 000/060 VUs, 40 complete and 0 interrupted iterations
api    [   1% ] 000/060 VUs  0m05.0s/8m0s  8.00 iters/s

running (0m06.0s), 000/060 VUs, 48 complete and 0 interrupted iterations
api    [   1% ] 000/060 VUs  0m06.0s/8m0s  8.00 iters/s

running (0m07.0s), 000/060 VUs, 56 complete and 0 interrupted iterations
api    [   1% ] 000/060 VUs  0m07.0s/8m0s  8.00 iters/s

running (0m08.0s), 000/060 VUs, 64 complete and 0 interrupted iterations
api    [   2% ] 000/060 VUs  0m08.0s/8m0s  8.00 iters/s

running (0m09.0s), 000/060 VUs, 72 complete and 0 interrupted iterations
api    [   2% ] 000/060 VUs  0m09.0s/8m0s  8.00 iters/s

running (0m10.0s), 000/060 VUs, 80 complete and 0 interrupted iterations
api    [   2% ] 000/060 VUs  0m10.0s/8m0s  8.00 iters/s

running (0m11.0s), 000/060 VUs, 88 complete and 0 interrupted iterations
api    [   2% ] 000/060 VUs  0m11.0s/8m0s  8.00 iters/s

running (0m12.0s), 000/060 VUs, 96 complete and 0 interrupted iterations
api    [   2% ] 000/060 VUs  0m12.0s/8m0s  8.00 iters/s

running (0m13.0s), 000/060 VUs, 104 complete and 0 interrupted iterations
api    [   3% ] 000/060 VUs  0m13.0s/8m0s  8.00 iters/s

running (0m14.0s), 000/060 VUs, 112 complete and 0 interrupted iterations
api    [   3% ] 000/060 VUs  0m14.0s/8m0s  8.00 iters/s

running (0m15.0s), 000/060 VUs, 120 complete and 0 interrupted iterations
api    [   3% ] 000/060 VUs  0m15.0s/8m0s  8.00 iters/s

running (0m16.0s), 000/060 VUs, 128 complete and 0 interrupted iterations
api    [   3% ] 000/060 VUs  0m16.0s/8m0s  8.00 iters/s

running (0m17.0s), 000/060 VUs, 136 complete and 0 interrupted iterations
api    [   4% ] 000/060 VUs  0m17.0s/8m0s  8.00 iters/s

running (0m18.0s), 000/060 VUs, 144 complete and 0 interrupted iterations
api    [   4% ] 000/060 VUs  0m18.0s/8m0s  8.00 iters/s

running (0m19.0s), 000/060 VUs, 152 complete and 0 interrupted iterations
api    [   4% ] 000/060 VUs  0m19.0s/8m0s  8.00 iters/s

running (0m20.0s), 000/060 VUs, 160 complete and 0 interrupted iterations
api    [   4% ] 000/060 VUs  0m20.0s/8m0s  8.00 iters/s

running (0m21.0s), 000/060 VUs, 168 complete and 0 interrupted iterations
api    [   4% ] 000/060 VUs  0m21.0s/8m0s  8.00 iters/s

running (0m22.0s), 000/060 VUs, 176 complete and 0 interrupted iterations
api    [   5% ] 000/060 VUs  0m22.0s/8m0s  8.00 iters/s

running (0m23.0s), 000/060 VUs, 184 complete and 0 interrupted iterations
api    [   5% ] 000/060 VUs  0m23.0s/8m0s  8.00 iters/s

running (0m24.0s), 000/060 VUs, 192 complete and 0 interrupted iterations
api    [   5% ] 000/060 VUs  0m24.0s/8m0s  8.00 iters/s

running (0m25.0s), 000/060 VUs, 200 complete and 0 interrupted iterations
api    [   5% ] 000/060 VUs  0m25.0s/8m0s  8.00 iters/s

running (0m26.0s), 000/060 VUs, 208 complete and 0 interrupted iterations
api    [   5% ] 000/060 VUs  0m26.0s/8m0s  8.00 iters/s

running (0m27.0s), 000/060 VUs, 216 complete and 0 interrupted iterations
api    [   6% ] 000/060 VUs  0m27.0s/8m0s  8.00 iters/s

running (0m28.0s), 000/060 VUs, 224 complete and 0 interrupted iterations
api    [   6% ] 000/060 VUs  0m28.0s/8m0s  8.00 iters/s

running (0m29.0s), 000/060 VUs, 232 complete and 0 interrupted iterations
api    [   6% ] 000/060 VUs  0m29.0s/8m0s  8.00 iters/s

running (0m30.0s), 000/060 VUs, 240 complete and 0 interrupted iterations
api    [   6% ] 000/060 VUs  0m30.0s/8m0s  8.00 iters/s

running (0m31.0s), 000/060 VUs, 248 complete and 0 interrupted iterations
api    [   6% ] 000/060 VUs  0m31.0s/8m0s  8.00 iters/s

running (0m32.0s), 000/060 VUs, 256 complete and 0 interrupted iterations
api    [   7% ] 000/060 VUs  0m32.0s/8m0s  8.00 iters/s

running (0m33.0s), 000/060 VUs, 264 complete and 0 interrupted iterations
api    [   7% ] 000/060 VUs  0m33.0s/8m0s  8.00 iters/s

running (0m34.0s), 000/060 VUs, 272 complete and 0 interrupted iterations
api    [   7% ] 000/060 VUs  0m34.0s/8m0s  8.00 iters/s

running (0m35.0s), 000/060 VUs, 280 complete and 0 interrupted iterations
api    [   7% ] 000/060 VUs  0m35.0s/8m0s  8.00 iters/s

running (0m36.0s), 000/060 VUs, 288 complete and 0 interrupted iterations
api    [   7% ] 000/060 VUs  0m36.0s/8m0s  8.00 iters/s

running (0m37.0s), 000/060 VUs, 296 complete and 0 interrupted iterations
api    [   8% ] 000/060 VUs  0m37.0s/8m0s  8.00 iters/s

running (0m38.0s), 000/060 VUs, 304 complete and 0 interrupted iterations
api    [   8% ] 000/060 VUs  0m38.0s/8m0s  8.00 iters/s

running (0m39.0s), 000/060 VUs, 312 complete and 0 interrupted iterations
api    [   8% ] 000/060 VUs  0m39.0s/8m0s  8.00 iters/s

running (0m40.0s), 000/060 VUs, 320 complete and 0 interrupted iterations
api    [   8% ] 000/060 VUs  0m40.0s/8m0s  8.00 iters/s

running (0m41.0s), 000/060 VUs, 328 complete and 0 interrupted iterations
api    [   9% ] 000/060 VUs  0m41.0s/8m0s  8.00 iters/s

running (0m42.0s), 000/060 VUs, 336 complete and 0 interrupted iterations
api    [   9% ] 000/060 VUs  0m42.0s/8m0s  8.00 iters/s

running (0m43.0s), 000/060 VUs, 344 complete and 0 interrupted iterations
api    [   9% ] 000/060 VUs  0m43.0s/8m0s  8.00 iters/s

running (0m44.0s), 000/060 VUs, 352 complete and 0 interrupted iterations
api    [   9% ] 000/060 VUs  0m44.0s/8m0s  8.00 iters/s

running (0m45.0s), 000/060 VUs, 360 complete and 0 interrupted iterations
api    [   9% ] 000/060 VUs  0m45.0s/8m0s  8.00 iters/s

running (0m46.0s), 000/060 VUs, 368 complete and 0 interrupted iterations
api    [  10% ] 000/060 VUs  0m46.0s/8m0s  8.00 iters/s

running (0m47.0s), 000/060 VUs, 376 complete and 0 interrupted iterations
api    [  10% ] 000/060 VUs  0m47.0s/8m0s  8.00 iters/s

running (0m48.0s), 000/060 VUs, 384 complete and 0 interrupted iterations
api    [  10% ] 000/060 VUs  0m48.0s/8m0s  8.00 iters/s

running (0m49.0s), 001/060 VUs, 391 complete and 0 interrupted iterations
api    [  10% ] 001/060 VUs  0m49.0s/8m0s  8.00 iters/s

running (0m50.0s), 000/060 VUs, 400 complete and 0 interrupted iterations
api    [  10% ] 000/060 VUs  0m50.0s/8m0s  8.00 iters/s

running (0m51.0s), 007/060 VUs, 401 complete and 0 interrupted iterations
api    [  11% ] 007/060 VUs  0m51.0s/8m0s  8.00 iters/s

running (0m52.0s), 011/060 VUs, 405 complete and 0 interrupted iterations
api    [  11% ] 011/060 VUs  0m52.0s/8m0s  8.00 iters/s

running (0m53.0s), 011/060 VUs, 413 complete and 0 interrupted iterations
api    [  11% ] 011/060 VUs  0m53.0s/8m0s  8.00 iters/s

running (0m54.0s), 010/060 VUs, 422 complete and 0 interrupted iterations
api    [  11% ] 010/060 VUs  0m54.0s/8m0s  8.00 iters/s

running (0m55.0s), 008/060 VUs, 432 complete and 0 interrupted iterations
api    [  11% ] 008/060 VUs  0m55.0s/8m0s  8.00 iters/s

running (0m56.0s), 008/060 VUs, 440 complete and 0 interrupted iterations
api    [  12% ] 008/060 VUs  0m56.0s/8m0s  8.00 iters/s

running (0m57.0s), 008/060 VUs, 448 complete and 0 interrupted iterations
api    [  12% ] 008/060 VUs  0m57.0s/8m0s  8.00 iters/s

running (0m58.0s), 006/060 VUs, 458 complete and 0 interrupted iterations
api    [  12% ] 006/060 VUs  0m58.0s/8m0s  8.00 iters/s

running (0m59.0s), 005/060 VUs, 467 complete and 0 interrupted iterations
api    [  12% ] 005/060 VUs  0m59.0s/8m0s  8.00 iters/s

running (1m00.0s), 004/060 VUs, 476 complete and 0 interrupted iterations
api    [  12% ] 004/060 VUs  1m00.0s/8m0s  8.00 iters/s

running (1m01.0s), 002/060 VUs, 486 complete and 0 interrupted iterations
api    [  13% ] 002/060 VUs  1m01.0s/8m0s  8.00 iters/s

running (1m02.0s), 000/060 VUs, 496 complete and 0 interrupted iterations
api    [  13% ] 000/060 VUs  1m02.0s/8m0s  8.00 iters/s

running (1m03.0s), 000/060 VUs, 504 complete and 0 interrupted iterations
api    [  13% ] 000/060 VUs  1m03.0s/8m0s  8.00 iters/s

running (1m04.0s), 000/060 VUs, 512 complete and 0 interrupted iterations
api    [  13% ] 000/060 VUs  1m04.0s/8m0s  8.00 iters/s

running (1m05.0s), 000/060 VUs, 520 complete and 0 interrupted iterations
api    [  14% ] 000/060 VUs  1m05.0s/8m0s  8.00 iters/s

running (1m06.0s), 000/060 VUs, 528 complete and 0 interrupted iterations
api    [  14% ] 000/060 VUs  1m06.0s/8m0s  8.00 iters/s

running (1m07.0s), 000/060 VUs, 536 complete and 0 interrupted iterations
api    [  14% ] 000/060 VUs  1m07.0s/8m0s  8.00 iters/s

running (1m08.0s), 000/060 VUs, 544 complete and 0 interrupted iterations
api    [  14% ] 000/060 VUs  1m08.0s/8m0s  8.00 iters/s

running (1m09.0s), 000/060 VUs, 552 complete and 0 interrupted iterations
api    [  14% ] 000/060 VUs  1m09.0s/8m0s  8.00 iters/s

running (1m10.0s), 000/060 VUs, 560 complete and 0 interrupted iterations
api    [  15% ] 000/060 VUs  1m10.0s/8m0s  8.00 iters/s

running (1m11.0s), 000/060 VUs, 568 complete and 0 interrupted iterations
api    [  15% ] 000/060 VUs  1m11.0s/8m0s  8.00 iters/s

running (1m12.0s), 000/060 VUs, 576 complete and 0 interrupted iterations
api    [  15% ] 000/060 VUs  1m12.0s/8m0s  8.00 iters/s

running (1m13.0s), 000/060 VUs, 584 complete and 0 interrupted iterations
api    [  15% ] 000/060 VUs  1m13.0s/8m0s  8.00 iters/s

running (1m14.0s), 000/060 VUs, 592 complete and 0 interrupted iterations
api    [  15% ] 000/060 VUs  1m14.0s/8m0s  8.00 iters/s

running (1m15.0s), 000/060 VUs, 600 complete and 0 interrupted iterations
api    [  16% ] 000/060 VUs  1m15.0s/8m0s  8.00 iters/s

running (1m16.0s), 000/060 VUs, 608 complete and 0 interrupted iterations
api    [  16% ] 000/060 VUs  1m16.0s/8m0s  8.00 iters/s

running (1m17.0s), 000/060 VUs, 616 complete and 0 interrupted iterations
api    [  16% ] 000/060 VUs  1m17.0s/8m0s  8.00 iters/s

running (1m18.0s), 000/060 VUs, 624 complete and 0 interrupted iterations
api    [  16% ] 000/060 VUs  1m18.0s/8m0s  8.00 iters/s

running (1m19.0s), 000/060 VUs, 632 complete and 0 interrupted iterations
api    [  16% ] 000/060 VUs  1m19.0s/8m0s  8.00 iters/s

running (1m20.0s), 000/060 VUs, 640 complete and 0 interrupted iterations
api    [  17% ] 000/060 VUs  1m20.0s/8m0s  8.00 iters/s

running (1m21.0s), 000/060 VUs, 648 complete and 0 interrupted iterations
api    [  17% ] 000/060 VUs  1m21.0s/8m0s  8.00 iters/s

running (1m22.0s), 000/060 VUs, 656 complete and 0 interrupted iterations
api    [  17% ] 000/060 VUs  1m22.0s/8m0s  8.00 iters/s

running (1m23.0s), 000/060 VUs, 664 complete and 0 interrupted iterations
api    [  17% ] 000/060 VUs  1m23.0s/8m0s  8.00 iters/s

running (1m24.0s), 000/060 VUs, 672 complete and 0 interrupted iterations
api    [  17% ] 000/060 VUs  1m24.0s/8m0s  8.00 iters/s

running (1m25.0s), 000/060 VUs, 680 complete and 0 interrupted iterations
api    [  18% ] 000/060 VUs  1m25.0s/8m0s  8.00 iters/s

running (1m26.0s), 000/060 VUs, 688 complete and 0 interrupted iterations
api    [  18% ] 000/060 VUs  1m26.0s/8m0s  8.00 iters/s

running (1m27.0s), 000/060 VUs, 696 complete and 0 interrupted iterations
api    [  18% ] 000/060 VUs  1m27.0s/8m0s  8.00 iters/s

running (1m28.0s), 000/060 VUs, 704 complete and 0 interrupted iterations
api    [  18% ] 000/060 VUs  1m28.0s/8m0s  8.00 iters/s

running (1m29.0s), 000/060 VUs, 712 complete and 0 interrupted iterations
api    [  19% ] 000/060 VUs  1m29.0s/8m0s  8.00 iters/s

running (1m30.0s), 000/060 VUs, 720 complete and 0 interrupted iterations
api    [  19% ] 000/060 VUs  1m30.0s/8m0s  8.00 iters/s

running (1m31.0s), 000/060 VUs, 728 complete and 0 interrupted iterations
api    [  19% ] 000/060 VUs  1m31.0s/8m0s  8.00 iters/s

running (1m32.0s), 000/060 VUs, 736 complete and 0 interrupted iterations
api    [  19% ] 000/060 VUs  1m32.0s/8m0s  8.00 iters/s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.20' rate=5.39%


  █ TOTAL RESULTS 

    checks_total.......: 742    7.997651/s
    checks_succeeded...: 94.60% 702 out of 742
    checks_failed......: 5.39%  40 out of 742

    ✗ api status 200
      ↳  94% — ✓ 702 / ✗ 40

    HTTP
    http_req_duration..............: avg=172.67ms min=555.96µs med=62.28ms max=1.91s p(90)=501.74ms p(95)=1.1s 
      { expected_response:true }...: avg=182.46ms min=60.34ms  med=62.33ms max=1.91s p(90)=616.22ms p(95)=1.12s
    http_req_failed................: 5.39%  40 out of 742
    http_reqs......................: 742    7.997651/s

    EXECUTION
    iteration_duration.............: avg=173.28ms min=768.45µs med=62.57ms max=1.93s p(90)=502ms    p(95)=1.1s 
    iterations.....................: 742    7.997651/s
    vus............................: 0      min=0         max=11
    vus_max........................: 60     min=60        max=60

    NETWORK
    data_received..................: 206 kB 2.2 kB/s
    data_sent......................: 82 kB  881 B/s



running (1m32.8s), 000/060 VUs, 742 complete and 1 interrupted iterations
api  ✗ [  19% ] 001/060 VUs  1m32.8s/8m0s  8.00 iters/s
time="2026-06-14T16:31:43Z" level=error msg="test run was aborted because k6 received a 'interrupt' signal"